README.tex
% Created 2017-06-11 Sun 15:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\usepackage{tabularx}
\author{Mario A. Barbara \\ Andrea Cancellieri}
\date{}
\title{giaco.ml\\\medskip
\large an interpreted EDSL written in OCAML}
\hypersetup{
 pdfauthor={Mario A. Barbara \\ Andrea Cancellieri},
 pdftitle={giaco.ml},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Introduction}
\label{sec:org86af44c}
giaco.ml is an imperative (but also functional) EDSL interpreter written in OCAML.

The interpreter is capable of handling expressions, commands and declarations all within a program.

A program can be parsed into valid code from a file/string thanks to reflection.

Static taint analysis can be performed, guards have been also
added to the Reflect command as a form of protection, similar to perl.

The main execution functions are: \texttt{interpret} (or \texttt{interpret'} which returns also the declarations' output), \texttt{reflect} and \texttt{taint\_analysis} which all operate on a \texttt{Prog(ds,cs)} construct.
\section{Design Choices}
\label{sec:orgf6e2393}
The interpreter works with 3 domains:
\begin{description}
\item[{generic}] this domain is shared amongst the syntax (external) and semantic (internal) domains
\item[{syntax}] this domain contains all the domains accessible to the user. it features 3 sub-domains
\begin{description}
\item[{expressions}] these are entities which may be mapped directly to a value
\item[{commands}] these are entities which allow modifying the global state of the program, though allocating new memory is not allowed
\item[{declarations}] these are entities which allow allocation of new memory in the global state
\end{description}
\item[{semantic}] this domain is used for representing the internal state of the interpreter.
\begin{description}
\item[{evaluatable values}] these are values that may be directly evaluated from an expressions. they represent the base internal type for the interpreter. Basic allowed types are Integer, Boolean, Float, String and Subprograms.
\item[{environment}] this is a mapping representing internal non-mutable state. It maps variables (identifiers) to values.
\item[{store}] this is a mapping representing internal mutable state. It allows aliasing of 2 identifiers for one value. It maps addresses (pointers or locations) to values.
\item[{denotable values}] these are values contained in the environment. Basic allowed types are  Integer, Boolean, Float, String and Locations.
\item[{mutable memory values}] these are values contained in the store. Basic allowed types are Integer, Boolean, Float, String.
\end{description}
\end{description}

The interpreter itself is implemented by 3 main functions:
\begin{description}
\item[{eval}] this function basically maps expressions to evaluatable values
\item[{cval}] this function maps commands to a changed internal state (store)
\item[{dval}] this function maps declarations to a new internal state (environment + store)
\end{description}

Some important choices:
\begin{itemize}
\item memory is viewed as a mapping. it is therefore impossible to modify in ocaml. changing the type signature of the interpreter would allow this
\item because memory is a mapping, new locations are simulated by randomly selecting a new location based on given store size
\item regular expressions are used in reflection, so the Str module must be available
\item fixed points are calculated through ocamls's \texttt{function} and \texttt{let rec} operations
\item to ease debugging, the interpreted is not compiled but interpreted in an ocaml shell with the \texttt{\#use "file.ml"} construct
\item since the program is interpreted, \texttt{let and} between multiple files is not available, this has been fixed by using mutable state pointers to future functions. These pointers will be updated
when the function is created.
\item many utility functions have been created to ease debugging. most notable are \texttt{emptyenv} \texttt{emptystore} \texttt{tenv'} \texttt{tstore'} \texttt{tnew'} which simplify dealing with memory
\item due to the non-recursive nature of \texttt{Procedure} and \texttt{Call}, they have been omitted from reflection and taint-analysis. The syntax restriction is due to the difficulty of implementing a parser 
for the complete OCAML list syntax, and the static analysis of commands that cannot be recursively unpacked (one lies in the \emph{expressions}, the other in the \emph{commands})
\end{itemize}
\section{Usage}
\label{sec:orgb7e2378}
the interpreter can be loaded up with
\begin{verbatim}
>> #use "giaco.ml";;
\end{verbatim}

and subsequent testing may be performed:
\begin{verbatim}
>> (* have a functional sample: *)
>> Plus(Int(3), Int(4)) in eval e emptyenv emptystore;;
- : evalue = EInt 7

>> (* now let's try a complete program *)
>> let e = Lambda("x",Multiply(Val("global"), Var("x"))) in
>> let d = New("global", Str("yes")) in
>> let c = Assign("global", Apply(e, Int(5))) in
>> let program = Prog(d,c) in
>> let result_environment, result_store = interpret' program emptyenv emptystore in
>> eval (Val("global")) result_environment result_store;;
- : evalue = EStr "yesyesyesyesyes"
\end{verbatim}

The most useful interpreter functions are:
\begin{description}
\item[{\texttt{eval: expr -> env -> store -> evalue}}] evaluates expressions
\item[{\texttt{cval: com -> env -> store -> store}}] converts commands into a modified mutable memory
\item[{\texttt{dval: dec -> env -> store -> env*store}}] allows extending mutable memory
\item[{\texttt{interpret: prog -> env -> store -> store} }] combines all of the above. cannot return expression values like eval, though, as we do not have print
functionality
\item[{\texttt{interpret': prog -> env -> store -> env*store} }] just like \texttt{interpret} but return the last evaluated environment as well, which allows for further 
analysis of the output
\item[{\texttt{emptyenv} and \texttt{emptystore}}] already initialized empty environment and store
\item[{\texttt{env'} and \texttt{store'}}] allow extending environments and stores outside of syntax. \texttt{new'} combines this and allows doing something like the \texttt{New(...)} command outside of syntax.
\item[{\texttt{ereflect} and \texttt{creflect} and \texttt{dreflect} and \texttt{reflect}}] reflection of expressions, commands, declarations, full blown programs.
\item[{\texttt{etaint} and \texttt{ctaint} and \texttt{dtaint} and \texttt{taint\_anlaysis}}] static taint analysis of expressions, commands, declarations and full blown programs.
\end{description}
