README.org
** EXPRESSIONS
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align lX
| EXAMPLE                                                    | DESCRIPTION                                                                    |
|------------------------------------------------------------+--------------------------------------------------------------------------------|
| Int(3)                                                     | basic integer                                                                  |
| Str("hello world")                                         | basic ASCII string                                                             |
| Bool(true)                                                 | basic boolean                                                                  |
| Float(4.5)                                                 | basic float                                                                    |
| Lambda("x", <exp containing x>)                            | typical function                                                               |
| RecLambda("f", "x", <exp containing f and x>)              | typical recursive function                                                     |
| Rec("f", Lambda(....))                                     | just another way to define recursive lambdas                                   |
| Proc(["x";"y";"z";...], Block(...))                        | this is a procedure, check the commands section                                |
| IfThenElse(Bool(true), .., ..)                             | control flow element                                                           |
| Var("x")                                                   | this is a way to retrieve an immutable variable's content                      |
| LetIn("x", e1, e2)                                         | this is a way to nest functional blocks and scopes                             |
| Val("x")                                                   | this is a way to retrieve a mutable variable's content                         |
| Plus(e1, e2)                                               | plus function, applies to: Int, Str, Float                                     |
| Multiply(e1, e2)                                           | multiply function, appliest to: Int, Str, Float                                |
| Apply(e1, e2)                                              | typical function application, e1 is of type: Lambda, RecLambda, Rec            |
| Equals(e1, e2)                                             | like C's ~==~                                                                  |
| Greater(e1, e2)                                            | like C's ~>~                                                                   |
| Not(e)                                                     | like C's ~!~                                                                   |
| Or(e1, e2)                                                 | like C's ~¦¦~                                                                  |
| And(e1, e2)                                                | like C's ~&&~                                                                  |
| Len( Str(...))                                             | gets the length of a St                                                        |
| Sub(Str(...), i, j)                                        | gets a substring. i and j of type Int.                                         |
| Lower(Str(..))                                             | reduces a string to lowercase, like Python's ~lower()~                         |
| Upper(Str(...))                                            | reduces a string to uppercase, like Python's ~upper()~                         |
| Trim(Str(...))                                             | trims whitespace from a string, like Python's ~s.trim()~                       |
| Replace(<string to be replace>,<replacer string>,<string>) | replaces a string with another string in a string, like Python's ~s.replace()~ |
** COMMANDS
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align lX
| EXAMPLE                | DESCRIPTION                                                                                          |
|------------------------+------------------------------------------------------------------------------------------------------|
| Assign("x", e)         | this changes the mutable value for the variable "x". e is an expression                              |
| Block(d, c)            | this is an imperative block with nested scope. d is a declaration, see its section for more detail   |
| Call(p, [e1;e2;e3;..]) | this is an application of an imperative procedure. p is of type Proc (check the expressions section) |
| While(e, c)            | like C's ~while(e){c}~, e is an expression and c a command                                           |
| CIfThen(e, c)          | like C's ~if(e){c}~                                                                                  |
| CIfThenElse(e, c1, c2) | like C's ~if(e){c1}else{c2}~                                                                         |
| CSeq(c1, c2)           | like C's ~;~ it allows concatenation of commands                                                     |
| CSkip                  | like C's ~void~ and Python's ~pass~, it does nothing                                                 |
| Reflect(Str(...))      | reflection, see the reflection section                                                               |
** DECLARATIONS
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align lX
| EXAMPLE      | DESCRIPTION                                                      |
|--------------+------------------------------------------------------------------|
| New("x", e)  | this allocates a new mutable variable of value e (an expression) |
| DSeq(d1, d2) | allows concatenation of declarations                             |
| DSkip        | does nothing                                                     |
** PROGRAM
NOTE :: to use the functional language only, please use expressions along with ~eval~. Programs are only imperative.
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align ll
| EXAMPLE                        | DESCRIPTION                            |
|--------------------------------+----------------------------------------|
| Prog(<declaration>, <command>) | handy syntax that puts it all together |
* String extension
A few functions have been added to deal with the domain of strings.
Functions such as these are taken from the Python langauge, which has a *very* extensive and popularstandard library.
- length comparison (~Greater~)
- concatenation (~Plus~ has been extended to allow this)
- substring (~Sub~)
- repetition (~Multiply~ has been extended to allow this)
- length (~Len~)
- lowercase (~Lower~)
- uppercase (~Upper~)
- trim (~Trim~), trims all whitespace
- Replace (~Replace~)

Check the examples section for some examples
