README.tex

\subsection{EXPRESSIONS}
\label{sec:orgb394e41}
\begin{center}
\begin{tabularx}{\textwidth}{lX}
EXAMPLE & DESCRIPTION\\
\hline
Int(3) & basic integer\\
Str("hello world") & basic ASCII string\\
Bool(true) & basic boolean\\
Float(4.5) & basic float\\
Lambda("x", <exp containing x>) & typical function\\
RecLambda("f", "x", <exp containing f and x>) & typical recursive function\\
Rec("f", Lambda(\ldots{}.)) & just another way to define recursive lambdas\\
Proc(["x";"y";"z";\ldots{}], Block(\ldots{})) & this is a procedure, check the commands section\\
IfThenElse(Bool(true), .., ..) & control flow element\\
Var("x") & this is a way to retrieve an immutable variable's content\\
LetIn("x", e1, e2) & this is a way to nest functional blocks and scopes\\
Val("x") & this is a way to retrieve a mutable variable's content\\
Plus(e1, e2) & plus function, applies to: Int, Str, Float\\
Multiply(e1, e2) & multiply function, appliest to: Int, Str, Float\\
Apply(e1, e2) & typical function application, e1 is of type: Lambda, RecLambda, Rec\\
Equals(e1, e2) & like C's \texttt{==}\\
Greater(e1, e2) & like C's \texttt{>}\\
Not(e) & like C's \texttt{!}\\
Or(e1, e2) & like C's \texttt{¦¦}\\
And(e1, e2) & like C's \texttt{\&\&}\\
Len( Str(\ldots{})) & gets the length of a St\\
Sub(Str(\ldots{}), i, j) & gets a substring. i and j of type Int.\\
Lower(Str(..)) & reduces a string to lowercase, like Python's \texttt{lower()}\\
Upper(Str(\ldots{})) & reduces a string to uppercase, like Python's \texttt{upper()}\\
Trim(Str(\ldots{})) & trims whitespace from a string, like Python's \texttt{s.trim()}\\
Replace(<string to be replace>,<replacer string>,<string>) & replaces a string with another string in a string, like Python's \texttt{s.replace()}\\
\end{tabularx}
\end{center}
\subsection{COMMANDS}
\label{sec:orgb7e4cbd}
\begin{center}
\begin{tabularx}{\textwidth}{lX}
EXAMPLE & DESCRIPTION\\
\hline
Assign("x", e) & this changes the mutable value for the variable "x". e is an expression\\
Block(d, c) & this is an imperative block with nested scope. d is a declaration, see its section for more detail\\
Call(p, [e1;e2;e3;..]) & this is an application of an imperative procedure. p is of type Proc (check the expressions section)\\
While(e, c) & like C's \texttt{while(e)\{c\}}, e is an expression and c a command\\
CIfThen(e, c) & like C's \texttt{if(e)\{c\}}\\
CIfThenElse(e, c1, c2) & like C's \texttt{if(e)\{c1\}else\{c2\}}\\
CSeq(c1, c2) & like C's \texttt{;} it allows concatenation of commands\\
CSkip & like C's \texttt{void} and Python's \texttt{pass}, it does nothing\\
Reflect(Str(\ldots{})) & reflection, see the reflection section\\
\end{tabularx}
\end{center}
\subsection{DECLARATIONS}
\label{sec:orgd814160}
\begin{center}
\begin{tabularx}{\textwidth}{lX}
EXAMPLE & DESCRIPTION\\
\hline
New("x", e) & this allocates a new mutable variable of value e (an expression)\\
DSeq(d1, d2) & allows concatenation of declarations\\
DSkip & does nothing\\
\end{tabularx}
\end{center}
\subsection{PROGRAM}
\label{sec:org2195b47}
\begin{tabularx}
\item[{NOTE}] to use the functional language only, please use expressions along with \texttt{eval}. Programs are only imperative.
\end{tabularx}

\begin{center}
\begin{tabular}{ll}
EXAMPLE & DESCRIPTION\\
\hline
Prog(<declaration>, <command>) & handy syntax that puts it all together\\
\end{tabular}
\end{center}
\section{String extension}
\label{sec:orgac519da}
A few functions have been added to deal with the domain of strings.
Functions such as these are taken from the Python langauge, which has a \textbf{very} extensive and popularstandard library.
\begin{itemize}
\item length comparison (\texttt{Greater})
\item concatenation (\texttt{Plus} has been extended to allow this)
\item substring (\texttt{Sub})
\item repetition (\texttt{Multiply} has been extended to allow this)
\item length (\texttt{Len})
\item lowercase (\texttt{Lower})
\item uppercase (\texttt{Upper})
\item trim (\texttt{Trim}), trims all whitespace
\item Replace (\texttt{Replace})
\end{itemize}

Check the examples section for some examples
