README.org
* Reflection extension
Reflection consists of allowing any string to be evaluated by the interpreter on the fly. In Python this is akeen to the ~eval~ function.
This is also the most essential step to having a good interpreter: the interactive console for Python,
 one of the most popular interpreted languages, is often called *R.E.P.L.* (Read Eval Print Loop).

The syntax of /giaco.ml/ has been extended with the ~Reflect~ command, which allows on the fly "evaluation" of commands.
Unfortuately our language's command syntax is recursive, and furthermore the ~CIfThenElse~ command
uses expressions as boolean conditions, which are also recursive.
Therefore, a full blown parser needed to be built to give a string some depth (such as that of an AST).

The reasoning is as follows:
1. a function called =next_unit= is charged with grabbing the first word up until a =(= or =)= or =,= or multiple consecutive repetitions.
2. to get the command to match against, =next_unit= is called on the string and the result is matched against some constants, taken from the language's syntax
3. to get a command's arguments (which may be recursive and contain any amount of =( ) ,=, caution must be taken to correctly identify the argument boundaries, which are all separated by a =,= comma. 2 options are given:
  - iterative :: by counting the number of open parentheses matched thus far, and decreasing each time a closed parentheses is found,
                 it is possible to correctly identify the recursive structure of the syntax.
  -  recursive (but faster) :: since we know the amount of parameter each command needs, it is
       simply required to recursively reflect upon the arguments' string as many times as needed.
       Of course, each time a command is consumed, it shall return the arguments' string, so as to allow its father to continue
       looking for arguments.

Our interpreter implements the recursive and faster technique. Here is a simple ditaa drawing to illustrate
the flow of this technique:
# build with: asciiflow.com
#+BEGIN_SRC ditaa
+------------------------------+
|  A(B(C(1), C(2), C(3), ...)) |
|                              |
+---------------+--------------+
                |
                v

+---+---------------------------+
| A | B   C   1   C   2
+-------+-----------------------+
    | B | C   1   C   2           <----+
    +-------+-------------------+      |
        | C | 1   C   2                |
        +-------+---------------+      |
            | 1 | C   2       |--------+
        --------+---------------+      |
        | C | 2                        |
        +-------+---------------+      |
            | 2 |             |--------+
            +---+---------------+
#+END_SRC
* Taint-Analysis extension
Static taint analysis consists of understanding how much damage some unsafe elements (of undefined value but defined nature) will yield.
A classic example is an unsanitized input on a HTML form, which may result in an SQL Injection attack and damage your company's most valuable assets.

In our simple language, we have no operations that deal with the outside world (yet). We are thereforce forced to ask the user to label some variables
in the environment and store as =Clean= or =Dirty=. Afterwards, we will analyze a program and check the ~Taint~ for every possible variable assignment.
The semantic domains have been revisited, allowing memory (environment and store) to only contain tainted values (or store locations, in the environment's case).

Our analysis is based on 2 simple concepts:
- pure evaluation :: a ~tor~ function will take 2 taints and return =Dirty= if one of them is as well, otherwise =Clean=. This process can be lazy.
     - All constants are =Clean=
     - If a function is involved (such as a ~Lambda~) then the formal parameters are identified as =Clean= (as they cannot be expressions) and then the body is analyzed. If the body is clean, the function is clean
     - A function application requires a ~tor~ amongst the analysis of the function itself and the passed parameter.
     - If a condition is involved, then 2 outputs are possible. If the condition is =Dirty=, that means the attacker may choose either output and (regardless of the output's default taint)
       will result in a =Dirty= value. If the condition is =Clean=, then either output may occur during execution, so they must be passed to ~tor~.
- imperative state change :: all possible assignments in a command are gathered. Only the latest possible assignments matter (if i set =x= to =Dirty= and then =Clean= it is =Clean=).
     - Afterwards, we check whether 2 branches are possible: if they are, a ~tor~ function must be applied to all assignments of same key, merging the 2 branches.
     - If the branches are subject to a condition (such as in a ~CIfThenElse~) then a =Dirty= condition will mean an attacker may choose amongst any of the 2 branches, therefore dirtying all 
       assignments of shared key (amongst the 2 branches). If the condition is =Clean=, then the normal merge has already evaluated taint with ~tor~.
* Examples
check test.ml for some code examples.
** Numbers
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align XX
| INPUT                            | OUTPUT       |
|----------------------------------+--------------|
| Int(5)                           | EInt 5       |
| Float(133.7)                     | EFloat 133.7 |
| Plus(Int(1), Int(2))             | EInt 3       |
| Multiply(Float(2.5),Float(10.0)) | EFloat 25    |
| Greater(Int(3),Int(5))           | EBool false  |
** Booleans
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                            | OUTPUT      |
|------------------------------------------------------------------+-------------|
| Bool(true)                                                       | EBool true  |
| Not(Bool(true))                                                  | EBool false |
| And(Equals(Float(4.5),Float(4.6)),Equals(Float(0.1),Float(0.1))) | EBool false |
| Or(Equals(Float(4.5),Float(4.6)),Equals(Float(0.1),Float(0.1)))  | EBool true  |
** Strings
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align XX
| INPUT                                                   | OUTPUT                                |
|---------------------------------------------------------+---------------------------------------|
| Str("hello world")                                      | EStr "hello world"                    |
| Plus(Str("hello "),Str("world!"))                       | EStr "hello world!"                   |
| Multiply(Str("abc"),Int(10))                            | EStr "abcabcabcabcabcabcabcabcabcabc" |
| Len(Multiply(Str("abc"),Int(10)))                       | EInt 30                               |
| Greater(Str("two"),Str("three"))                        | EBool false                           |
| Sub(Str("threeeeeeee"),Int(2),Int(10))                  | EStr "reeeeeeee"                      |
| Upper(Str("im so lonely"))                              | EStr "IM SO LONELY"                   |
| Lower(Upper(Str("im so lonely")))                       | EStr "im so lonely"                   |
| Trim(Str("     italia      "))                          | EStr "italia"                         |
| Replace(Str("hello"),Str("goodbye"),Str("hello world!")) | EStr "goodbye world!"                |
** Functional Control Flow
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                                      | OUTPUT            |
|----------------------------------------------------------------------------+-------------------|
| IfThenElse(Bool(true), Int(1337), Str("i am"))                             | EInt 1337         |
| IfThenElse(Not(Greater(Str("bob"),Str("mouse"))),Str("ciao mondo"),Int(5)) | EStr "ciao mondo" |
