README.tex
\section{Reflection extension}
\label{sec:orgb2c4cba}
Reflection consists of allowing any string to be evaluated by the interpreter on the fly. In Python this is akeen to the \texttt{eval} function.
This is also the most essential step to having a good interpreter: the interactive console for Python,
 one of the most popular interpreted languages, is often called \textbf{R.E.P.L.} (Read Eval Print Loop).

The syntax of \emph{giaco.ml} has been extended with the \texttt{Reflect} command, which allows on the fly "evaluation" of commands.
Unfortuately our language's command syntax is recursive, and furthermore the \texttt{CIfThenElse} command
uses expressions as boolean conditions, which are also recursive.
Therefore, a full blown parser needed to be built to give a string some depth (such as that of an AST).

The reasoning is as follows:
\begin{enumerate}
\item a function called \texttt{next\_unit} is charged with grabbing the first word up until a \texttt{(} or \texttt{)} or \texttt{,} or multiple consecutive repetitions.
\item to get the command to match against, \texttt{next\_unit} is called on the string and the result is matched against some constants, taken from the language's syntax
\item to get a command's arguments (which may be recursive and contain any amount of \texttt{( ) ,}, caution must be taken to correctly identify the argument boundaries, which are all separated by a \texttt{,} comma. 2 options are given:
\begin{description}
\item[{iterative}] by counting the number of open parentheses matched thus far, and decreasing each time a closed parentheses is found,
it is possible to correctly identify the recursive structure of the syntax.
\item[{recursive (but faster)}] since we know the amount of parameter each command needs, it is
simply required to recursively reflect upon the arguments' string as many times as needed.
Of course, each time a command is consumed, it shall return the arguments' string, so as to allow its father to continue
looking for arguments.
\end{description}
\end{enumerate}

Our interpreter implements the recursive and faster technique. Here is a simple ditaa drawing to illustrate
the flow of this technique:

\begin{verbatim}
+------------------------------+
|  A(B(C(1), C(2), C(3), ...)) |
|                              |
+---------------+--------------+
                |
                v

+---+---------------------------+
| A | B   C   1   C   2
+-------+-----------------------+
    | B | C   1   C   2           <----+
    +-------+-------------------+      |
        | C | 1   C   2                |
        +-------+---------------+      |
            | 1 | C   2       |--------+
        --------+---------------+      |
        | C | 2                        |
        +-------+---------------+      |
            | 2 |             |--------+
            +---+---------------+
\end{verbatim}
\section{Taint-Analysis extension}
\label{sec:orge79958c}
Static taint analysis consists of understanding how much damage some unsafe elements (of undefined value but defined nature) will yield.
A classic example is an unsanitized input on a HTML form, which may result in an SQL Injection attack and damage your company's most valuable assets.

In our simple language, we have no operations that deal with the outside world (yet). We are thereforce forced to ask the user to label some variables
in the environment and store as \texttt{Clean} or \texttt{Dirty}. Afterwards, we will analyze a program and check the \texttt{Taint} for every possible variable assignment.
The semantic domains have been revisited, allowing memory (environment and store) to only contain tainted values (or store locations, in the environment's case).

Our analysis is based on 2 simple concepts:
\begin{description}
\item[{pure evaluation}] a \texttt{tor} function will take 2 taints and return \texttt{Dirty} if one of them is as well, otherwise \texttt{Clean}. This process can be lazy.
\begin{itemize}
\item All constants are \texttt{Clean}
\item If a function is involved (such as a \texttt{Lambda}) then the formal parameters are identified as \texttt{Clean} (as they cannot be expressions) and then the body is analyzed. If the body is clean, the function is clean
\item A function application requires a \texttt{tor} amongst the analysis of the function itself and the passed parameter.
\item If a condition is involved, then 2 outputs are possible. If the condition is \texttt{Dirty}, that means the attacker may choose either output and (regardless of the output's default taint)
will result in a \texttt{Dirty} value. If the condition is \texttt{Clean}, then either output may occur during execution, so they must be passed to \texttt{tor}.
\end{itemize}
\item[{imperative state change}] all possible assignments in a command are gathered. Only the latest possible assignments matter (if i set \texttt{x} to \texttt{Dirty} and then \texttt{Clean} it is \texttt{Clean}).
\begin{itemize}
\item Afterwards, we check whether 2 branches are possible: if they are, a \texttt{tor} function must be applied to all assignments of same key, merging the 2 branches.
\item If the branches are subject to a condition (such as in a \texttt{CIfThenElse}) then a \texttt{Dirty} condition will mean an attacker may choose amongst any of the 2 branches, therefore dirtying all 
assignments of shared key (amongst the 2 branches). If the condition is \texttt{Clean}, then the normal merge has already evaluated taint with \texttt{tor}.
\end{itemize}
\end{description}
\section{Examples}
\label{sec:org905c3a9}
check test.ml for some code examples.
\subsection{Numbers}
\label{sec:orgf331cd6}
\begin{center}
\begin{tabularx}{\textwidth}{XX}
INPUT & OUTPUT\\
\hline
Int(5) & EInt 5\\
Float(133.7) & EFloat 133.7\\
Plus(Int(1), Int(2)) & EInt 3\\
Multiply(Float(2.5),Float(10.0)) & EFloat 25\\
Greater(Int(3),Int(5)) & EBool false\\
\end{tabularx}
\end{center}
\subsection{Booleans}
\label{sec:org7f0706c}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & OUTPUT\\
\hline
Bool(true) & EBool true\\
Not(Bool(true)) & EBool false\\
And(Equals(Float(4.5),Float(4.6)),Equals(Float(0.1),Float(0.1))) & EBool false\\
Or(Equals(Float(4.5),Float(4.6)),Equals(Float(0.1),Float(0.1))) & EBool true\\
\end{tabularx}
\end{center}
\subsection{Strings}
\label{sec:org12bc716}
\begin{center}
\begin{tabularx}{\textwidth}{XX}
INPUT & OUTPUT\\
\hline
Str("hello world") & EStr "hello world"\\
Plus(Str("hello "),Str("world!")) & EStr "hello world!"\\
Multiply(Str("abc"),Int(10)) & EStr "abcabcabcabcabcabcabcabcabcabc"\\
Len(Multiply(Str("abc"),Int(10))) & EInt 30\\
Greater(Str("two"),Str("three")) & EBool false\\
Sub(Str("threeeeeeee"),Int(2),Int(10)) & EStr "reeeeeeee"\\
Upper(Str("im so lonely")) & EStr "IM SO LONELY"\\
Lower(Upper(Str("im so lonely"))) & EStr "im so lonely"\\
Trim(Str("     italia      ")) & EStr "italia"\\
Replace(Str("hello"),Str("goodbye"),Str("hello world!")) & EStr "goodbye world!"\\
\end{tabularx}
\end{center}
\subsection{Functional Control Flow}
\label{sec:orge1ecf79}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & OUTPUT\\
\hline
IfThenElse(Bool(true), Int(1337), Str("i am")) & EInt 1337\\
IfThenElse(Not(Greater(Str("bob"),Str("mouse"))),Str("ciao mondo"),Int(5)) & EStr "ciao mondo"\\
\end{tabularx}
\end{center}
