README.org
** Functional Blocks
   #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                                                       | OUTPUT  |
|---------------------------------------------------------------------------------------------+---------|
| Var("x")                                                                                    | EInt 20 |
| ~xxx =~ LetIn("a",Int(3),Multiply(Var("a"),Var("a")))                                       | EInt 9  |
| LetIn("a",Int(5),(LetIn("b",xxx,LetIn("c",Int(6),Plus(Var("a"),Plus(Var("b"),Var("c"))))))) | EInt 20 |
** Functional Subprograms
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                                                                                                                 | OUTPUT       |
|-------------------------------------------------------------------------------------------------------------------------------------------------------+--------------|
| Apply(Lambda("x", Plus(Var("x"), Int(1))), Int(99))                                                                                                   | EInt 100     |
| Apply(RecLambda("fact", "x", IfThenElse(Equals(Var("x"), Int(0)), Int(1), Multiply(Var("x"), Apply(Var("fact"), Plus(Var("x"), Int(-1)))))), Int(10)) | EInt 3628800 |
** Imperative State Change
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align ll
| INPUT                                 | VARIABLE OUTPUT |
|---------------------------------------+-----------------|
| Val("y")                              | EInt 10         |
| Assign("y", Plus(Val("y"), Val("y"))) | EInt 20         |
** Imperative Control Flow
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                                                                                   | VARIABLE OUTPUT  |
|-------------------------------------------------------------------------------------------------------------------------+------------------|
| Val("y"), Val("z")                                                                                                      | EInt 10, EInt 0  |
| CIfThenElse(Not(Equals(Val("y"),Int(11))), Assign("y", Int(50)))                                                        | EInt 50, EInt 0  |
| While(Not(Equals(Val("y"), Int(100))), CSeq(Assign("y", Plus(Val("y"), Int(1))), Assign("z", Plus(Val("z"), Int(1)))) ) | EInt 50, EInt 50 |
** Imperative Blocks
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                           | OUTPUT            |
|-----------------------------------------------------------------+-------------------|
| Val("y"), Val("z")                                              | EInt 10, EInt 0   |
| Block(New("z", Int(1000)), Assign("y", Plus(Val "y", Val "z"))) | EInt 1010, EInt 0 |
** Imperative Subprograms
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                                                | OUTPUT          |
|--------------------------------------------------------------------------------------+-----------------|
| Val("y"), Val("z")                                                                   | EInt 10, EInt 0 |
| ~f =~ Proc(["z"], Block(DSkip, Assign("y", Val("z"))))) in Call (Val "f", [Val "z"]) | EInt 0, EInt 0  |
** Declarations
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align lX
| INPUT                                     | OUTPUT                                                         |
|-------------------------------------------+----------------------------------------------------------------|
| Val("y"), Val("z")                        | Failure 'y' not in environment, Failure 'z' not in environment |
| DSeq(New("y", Int(10)), New("z", Int(0))) | EInt 10, EInt 0                                                |
** Reflection
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align Xl
| INPUT                                                           | OUTPUT  |
|-----------------------------------------------------------------+---------|
| Val("y")                                                        | EInt 10 |
| ~ereflect~ ("Plus(Plus(Int(1), Int(2)), Plus(Int(3), Int(4)))") | EInt 10 |
| Reflect(Str("Assign(\"y\", Int(5))"))                           | EInt 5  |
** Taint Analysis
   "dirty" is Dirty, "clean" is Clean
  #+ATTR_LATEX: :environment tabularx :width \textwidth :align lX
   | INPUT     | VALUE                                                      |
   |-----------+------------------------------------------------------------|
   | ~"dirty"~ | Dirty                                                      |
   | ~"clean"~ | Clean                                                      |
   | ~e~       | Equals(Plus(Val("x"),Val("y")),Int(6))                     |
   | ~assign1~ | CSeq(Assign("x", Val("dirty")), Assign("y", Val("clean"))) |
   | ~assign2~ | CSeq(Assign("x", Val("clean")), Assign("y", Val("dirty"))) |
   | ~d~       | DSeq(New("x", Val("dirty")), New("y", Val("clean")))       |
   | ~c~       | CIfThenElse(e, assign1, assign2)                           |

  #+ATTR_LATEX: :environment tabularx :width \textwidth :align lX
| INPUT                      | OUTPUT                                                                       |
|----------------------------+------------------------------------------------------------------------------|
| ~taint_analysis~ Prog(d,c) | [("clean", TLoc 15n); ("dirty", TLoc 27n); ("x", TLoc 76n); ("y", TLoc 41n)] |
|                            | [(15n, Clean); (27n, Dirty); (41n, Dirty); (76n, Dirty)]                     |
* Noted Bugs:
- reflection on the ~Reflect~ command is supposedly allowed (since it is implemented recursively) but OCAML's escape of strings within strings is weird and needs some fixing...
