README.tex
\subsection{Functional Blocks}
\label{sec:orgac3b10a}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & OUTPUT\\
\hline
Var("x") & EInt 20\\
\texttt{xxx =} LetIn("a",Int(3),Multiply(Var("a"),Var("a"))) & EInt 9\\
LetIn("a",Int(5),(LetIn("b",xxx,LetIn("c",Int(6),Plus(Var("a"),Plus(Var("b"),Var("c"))))))) & EInt 20\\
\end{tabularx}
\end{center}
\subsection{Functional Subprograms}
\label{sec:org8e0ed7a}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & OUTPUT\\
\hline
Apply(Lambda("x", Plus(Var("x"), Int(1))), Int(99)) & EInt 100\\
Apply(RecLambda("fact", "x", IfThenElse(Equals(Var("x"), Int(0)), Int(1), Multiply(Var("x"), Apply(Var("fact"), Plus(Var("x"), Int(-1)))))), Int(10)) & EInt 3628800\\
\end{tabularx}
\end{center}
\subsection{Imperative State Change}
\label{sec:org9843e3c}
\begin{center}
\begin{tabularx}{\textwidth}{ll}
INPUT & VARIABLE OUTPUT\\
\hline
Val("y") & EInt 10\\
Assign("y", Plus(Val("y"), Val("y"))) & EInt 20\\
\end{tabularx}
\end{center}
\subsection{Imperative Control Flow}
\label{sec:orgd2c24f3}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & VARIABLE OUTPUT\\
\hline
Val("y"), Val("z") & EInt 10, EInt 0\\
CIfThenElse(Not(Equals(Val("y"),Int(11))), Assign("y", Int(50))) & EInt 50, EInt 0\\
While(Not(Equals(Val("y"), Int(100))), CSeq(Assign("y", Plus(Val("y"), Int(1))), Assign("z", Plus(Val("z"), Int(1)))) ) & EInt 50, EInt 50\\
\end{tabularx}
\end{center}
\subsection{Imperative Blocks}
\label{sec:orgb373a66}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & OUTPUT\\
\hline
Val("y"), Val("z") & EInt 10, EInt 0\\
Block(New("z", Int(1000)), Assign("y", Plus(Val "y", Val "z"))) & EInt 1010, EInt 0\\
\end{tabularx}
\end{center}
\subsection{Imperative Subprograms}
\label{sec:orgadb08c9}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & OUTPUT\\
\hline
Val("y"), Val("z") & EInt 10, EInt 0\\
\texttt{f =} Proc(["z"], Block(DSkip, Assign("y", Val("z"))))) in Call (Val "f", [Val "z"]) & EInt 0, EInt 0\\
\end{tabularx}
\end{center}
\subsection{Declarations}
\label{sec:orgfec8186}
\begin{center}
\begin{tabularx}{\textwidth}{lX}
INPUT & OUTPUT\\
\hline
Val("y"), Val("z") & Failure 'y' not in environment, Failure 'z' not in environment\\
DSeq(New("y", Int(10)), New("z", Int(0))) & EInt 10, EInt 0\\
\end{tabularx}
\end{center}
\subsection{Reflection}
\label{sec:orga90ae19}
\begin{center}
\begin{tabularx}{\textwidth}{Xl}
INPUT & OUTPUT\\
\hline
Val("y") & EInt 10\\
\texttt{ereflect} ("Plus(Plus(Int(1), Int(2)), Plus(Int(3), Int(4)))") & EInt 10\\
Reflect(Str("Assign($\backslash$"y$\backslash$", Int(5))")) & EInt 5\\
\end{tabularx}
\end{center}
\subsection{Taint Analysis}
\label{sec:org7baad47}
"dirty" is Dirty, "clean" is Clean
\begin{center}
\begin{tabularx}{\textwidth}{lX}
INPUT & VALUE\\
\hline
\texttt{"dirty"} & Dirty\\
\texttt{"clean"} & Clean\\
\texttt{e} & Equals(Plus(Val("x"),Val("y")),Int(6))\\
\texttt{assign1} & CSeq(Assign("x", Val("dirty")), Assign("y", Val("clean")))\\
\texttt{assign2} & CSeq(Assign("x", Val("clean")), Assign("y", Val("dirty")))\\
\texttt{d} & DSeq(New("x", Val("dirty")), New("y", Val("clean")))\\
\texttt{c} & CIfThenElse(e, assign1, assign2)\\
\end{tabularx}
\end{center}

\begin{center}
\begin{tabularx}{\textwidth}{lX}
INPUT & OUTPUT\\
\hline
\texttt{taint\_analysis} Prog(d,c) & [("clean", TLoc 15n); ("dirty", TLoc 27n); ("x", TLoc 76n); ("y", TLoc 41n)]\\
 & [(15n, Clean); (27n, Dirty); (41n, Dirty); (76n, Dirty)]\\
\end{tabularx}
\end{center}
\section{Noted Bugs:}
\label{sec:org12165e2}
\begin{itemize}
\item reflection on the \texttt{Reflect} command is supposedly allowed (since it is implemented recursively) but OCAML's escape of strings within strings is weird and needs some fixing\ldots{}
\end{itemize}
\end{document}
